//
//  data.swift
//  Memorize
//
//  Created by Danny Boie on 3/22/24.
//

import Foundation

//Key : theme name, theme color, theme emojis
let themes: [String: (String, String, [String])] = [
    "foodTheme": (
        "Food",
        "red",
        ["🍎","🍉","🍌","🍒","🍓","🍍","🥯","🍳","🥩","🍔","🍎","🍉","🍌","🍒","🍓","🍍","🥯","🍳","🥩","🍔"]
    ),
    "vehicleTheme": (
        "Vehicles",
        "blue",
        ["🚗","🏎️","🛻","🚕","🚓","🚚","🚙","🚑","🚛","🚌","🚗","🏎️","🛻","🚕","🚓","🚚","🚙","🚑","🚛","🚌"]
    ),
    "animalTheme": (
        "Animals",
        "Yellow",
        ["🐶","🦊","🐯","🐸","🐱","🐻","🦁","🐵","🐭","🐼","🐶","🦊","🐯","🐸","🐱","🐻","🦁","🐵","🐭","🐼"]
    ),
]

